八字四柱排盤原理及源碼（PHP、Java和Python）

一、四柱原理 四柱八字是中國古老的命理學術之一，也是中國傳統文化的重要組成部分。四柱八字是根據人的出生年、月、日、時四個要素，推算出一個人的八個字，即八個字的命理學基礎信息，包括年柱、月柱、日柱、時柱，每個柱子上有兩個字，分別是天干和地支。四柱八字是命理學中重要的預測方法之一，通過對八字的綜合分析，可以預測一個人的命運、事業、婚姻、財運等方面的情況。

四柱八字的預測原理主要包括以下幾個方面：

1.五行相生相克 五行是中國古代的一種哲學概念，包括金、木、水、火、土五種元素。五行相生相克是指五行之間的相互作用關系，相生是指五行之間存在著相生關系，即金生水、水生木、木生火、火生土、土生金；相克是指五行之間存在著相克關系，即金克木、木克土、土克水、水克火、火克金。四柱八字中每個柱子上的天干地支都對應著五行，通過五行相生相克的關系，可以推算出一個人的五行屬性，從而預測其命運、事業、婚姻、財運等方面的情況。

2.天干地支的陰陽屬性 天干和地支都有陰陽屬性，天干分爲陽干和陰干，地支分爲陽支和陰支。陽干和陽支代表陽性，陰干和陰支代表陰性。通過四柱八字中天干地支的陰陽屬性，可以推算出一個人的陰陽屬性，從而預測其命運、事業、婚姻、財運等方面的情況。

3.天干地支的十二長生 天干地支還有十二長生，分別是長生、沐浴、冠帶、臨官、帝旺、衰、病、死、墓、絕、胎、養。十二長生是根據天干地支的陰陽屬性、五行相生相克關系和天干地支的位置關系而來的。通過四柱八字中天干地支的十二長生，可以推算出一個人的吉兇、命運、事業、婚姻、財運等方面的情況。

4.天干地支的藏干 天干地支還有藏干，是指每個柱子中除了天干地支外，還有其他的天干地支，這些天干地支就叫作藏干。通過四柱八字中天干地支的藏干，可以推算出一個人的性格、命運、事業、婚姻、財運等方面的情況。

5.天干地支的納音 天干地支還有納音，是指每個天干地支都對應著一個音律，這個音律就叫做納音。通過四柱八字中天干地支的納音，可以推算出一個人的命運、事業、婚姻、財運等方面的情況。

四柱八字的預測原理就是通過對四柱八字的綜合分析，可以推算出一個人的命運、事業、婚姻、財運等方面的情況。但需要注意的是，四柱八字只是一種預測方法，不能完全代替個人的努力和決策，人的命運還是要靠自己的努力去創造的。

二、八字四柱計算和排盤源碼PHP
<?php

// 云市場分配的密鑰Id
$secretId = 'xxxx';
// 云市場分配的密鑰Key
$secretKey = 'xxxx';
$source = 'market';

// 簽名
$datetime = gmdate('D, d M Y H:i:s T');
$signStr = sprintf("x-date: %s\nx-source: %s", $datetime, $source);
$sign = base64_encode(hash_hmac('sha1', $signStr, $secretKey, true));
$auth = sprintf('hmac id="%s", algorithm="hmac-sha1", headers="x-date x-source", signature="%s"', $secretId, $sign);

// 請求方法
$method = 'GET';
// 請求頭
$headers = array(
    'X-Source' => $source,
    'X-Date' => $datetime,
    'Authorization' => $auth,
    
);
// 查詢參數
$queryParams = array ( 'day' => '', 'hour' => '', 'ming' => '', 'minute' => '', 'month' => '', 'sex' => '', 'xing' => '', 'year' => '', 'yearType' => '',);
// body參數（POST方法下）
$bodyParams = array (

);
// url參數拼接
$url = 'https://service-90p4z4xs-1300683954.gz.apigw.tencentcs.com/release/bazi';
if (count($queryParams) > 0) {
    $url .= '?' . http_build_query($queryParams);
}

$ch = curl_init();
curl_setopt($ch, CURLOPT_URL, $url);
curl_setopt($ch, CURLOPT_RETURNTRANSFER, true);
curl_setopt($ch, CURLOPT_TIMEOUT, 60);
curl_setopt($ch, CURLOPT_CUSTOMREQUEST, $method);
curl_setopt($ch, CURLOPT_HTTPHEADER, array_map(function ($v, $k) {
    return $k . ': ' . $v;
}, array_values($headers), array_keys($headers)));
if (in_array($method, array('POST', 'PUT', 'PATCH'), true)) {
    curl_setopt($ch, CURLOPT_POSTFIELDS, http_build_query($bodyParams));
}

$data = curl_exec($ch);
if (curl_errno($ch)) {
    echo "Error: " . curl_error($ch);
} else {
    print_r($data);
}
curl_close($ch);
三、八字四柱計算和排盤源碼Java
import java.io.BufferedReader;
import java.io.DataOutputStream;
import java.io.InputStreamReader;
import java.io.UnsupportedEncodingException;
import java.net.HttpURLConnection;
import java.net.URL;
import java.net.URLEncoder;
import java.security.InvalidKeyException;
import java.security.Key;
import java.security.NoSuchAlgorithmException;
import java.text.SimpleDateFormat;
import java.util.Calendar;
import java.util.HashMap;
import java.util.Locale;
import java.util.Map;
import java.util.TimeZone;

import javax.crypto.Mac;
import javax.crypto.spec.SecretKeySpec;

import sun.misc.BASE64Encoder;


class Demo {
    public static String calcAuthorization(String source, String secretId, String secretKey, String datetime)
            throws NoSuchAlgorithmException, UnsupportedEncodingException, InvalidKeyException {
        String signStr = "x-date: " + datetime + "\n" + "x-source: " + source;
        Mac mac = Mac.getInstance("HmacSHA1");
        Key sKey = new SecretKeySpec(secretKey.getBytes("UTF-8"), mac.getAlgorithm());
        mac.init(sKey);
        byte[] hash = mac.doFinal(signStr.getBytes("UTF-8"));
        String sig = new BASE64Encoder().encode(hash);

        String auth = "hmac id=\"" + secretId + "\", algorithm=\"hmac-sha1\", headers=\"x-date x-source\", signature=\"" + sig + "\"";
        return auth;
    }

    public static String urlencode(Map<?, ?> map) throws UnsupportedEncodingException {
        StringBuilder sb = new StringBuilder();
        for (Map.Entry<?, ?> entry : map.entrySet()) {
            if (sb.length() > 0) {
                sb.append("&");
            }
            sb.append(String.format("%s=%s",
                    URLEncoder.encode(entry.getKey().toString(), "UTF-8"),
                    URLEncoder.encode(entry.getValue().toString(), "UTF-8")
            ));
        }
        return sb.toString();
    }

    public static void main(String[] args) throws NoSuchAlgorithmException, UnsupportedEncodingException, InvalidKeyException {
        //云市場分配的密鑰Id
        String secretId = "xxxx";
        //云市場分配的密鑰Key
        String secretKey = "xxxx";
        String source = "market";

        Calendar cd = Calendar.getInstance();
        SimpleDateFormat sdf = new SimpleDateFormat("EEE, dd MMM yyyy HH:mm:ss 'GMT'", Locale.US);
        sdf.setTimeZone(TimeZone.getTimeZone("GMT"));
        String datetime = sdf.format(cd.getTime());
        // 簽名
        String auth = calcAuthorization(source, secretId, secretKey, datetime);
        // 請求方法
        String method = "GET";
        // 請求頭
        Map<String, String> headers = new HashMap<String, String>();
        headers.put("X-Source", source);
        headers.put("X-Date", datetime);
        headers.put("Authorization", auth);

        // 查詢參數
        Map<String, String> queryParams = new HashMap<String, String>();
        queryParams.put("day","");
        queryParams.put("hour","");
        queryParams.put("ming","");
        queryParams.put("minute","");
        queryParams.put("month","");
        queryParams.put("sex","");
        queryParams.put("xing","");
        queryParams.put("year","");
        queryParams.put("yearType","");
        // body參數
        Map<String, String> bodyParams = new HashMap<String, String>();

        // url參數拼接
        String url = "https://service-90p4z4xs-1300683954.gz.apigw.tencentcs.com/release/bazi";
        if (!queryParams.isEmpty()) {
            url += "?" + urlencode(queryParams);
        }

        BufferedReader in = null;
        try {
            URL realUrl = new URL(url);
            HttpURLConnection conn = (HttpURLConnection) realUrl.openConnection();
            conn.setConnectTimeout(5000);
            conn.setReadTimeout(5000);
            conn.setRequestMethod(method);

            // request headers
            for (Map.Entry<String, String> entry : headers.entrySet()) {
                conn.setRequestProperty(entry.getKey(), entry.getValue());
            }

            // request body
            Map<String, Boolean> methods = new HashMap<>();
            methods.put("POST", true);
            methods.put("PUT", true);
            methods.put("PATCH", true);
            Boolean hasBody = methods.get(method);
            if (hasBody != null) {
                conn.setRequestProperty("Content-Type", "application/x-www-form-urlencoded");

                conn.setDoOutput(true);
                DataOutputStream out = new DataOutputStream(conn.getOutputStream());
                out.writeBytes(urlencode(bodyParams));
                out.flush();
                out.close();
            }

            // 定義 BufferedReader輸入流來讀取URL的響應
            in = new BufferedReader(new InputStreamReader(conn.getInputStream()));
            String line;
            String result = "";
            while ((line = in.readLine()) != null) {
                result += line;
            }

            System.out.println(result);
        } catch (Exception e) {
            System.out.println(e);
            e.printStackTrace();
        } finally {
            try {
                if (in != null) {
                    in.close();
                }
            } catch (Exception e2) {
                e2.printStackTrace();
            }
        }
    }
}
四、八字四柱計算和排盤源碼Python
# -*- coding: utf-8 -*-
from __future__ import print_function

import ssl, hmac, base64, hashlib
from datetime import datetime as pydatetime

try:
    from urllib import urlencode
    from urllib2 import Request, urlopen
except ImportError:
    from urllib.parse import urlencode
    from urllib.request import Request, urlopen

# 云市場分配的密鑰Id
secretId = "xxxx"
# 云市場分配的密鑰Key
secretKey = "xxxx"
source = "market"

# 簽名
datetime = pydatetime.utcnow().strftime('%a, %d %b %Y %H:%M:%S GMT')
signStr = "x-date: %s\nx-source: %s" % (datetime, source)
sign = base64.b64encode(hmac.new(secretKey.encode('utf-8'), signStr.encode('utf-8'), hashlib.sha1).digest())
auth = 'hmac id="%s", algorithm="hmac-sha1", headers="x-date x-source", signature="%s"' % (secretId, sign.decode('utf-8'))

# 請求方法
method = 'GET'
# 請求頭
headers = {
    'X-Source': source,
    'X-Date': datetime,
    'Authorization': auth,
    
}
# 查詢參數
queryParams = { "day": "", "hour": "", "ming": "", "minute": "", "month": "", "sex": "", "xing": "", "year": "", "yearType": ""}
# body參數（POST方法下存在）
bodyParams = {
}
# url參數拼接
url = 'https://service-90p4z4xs-1300683954.gz.apigw.tencentcs.com/release/bazi'
if len(queryParams.keys()) > 0:
    url = url + '?' + urlencode(queryParams)

request = Request(url, headers=headers)
request.get_method = lambda: method
if method in ('POST', 'PUT', 'PATCH'):
    request.data = urlencode(bodyParams).encode('utf-8')
    request.add_header('Content-Type', 'application/x-www-form-urlencoded')
ctx = ssl.create_default_context()
ctx.check_hostname = False
ctx.verify_mode = ssl.CERT_NONE
response = urlopen(request, context=ctx)
content = response.read()
if content:
    print(content.decode('utf-8'))
五、排盤結果數據和詳細解釋
{
    "code":0,
    "msg":"成功",
    "data":{
        "命主信息":{
            "姓名":"楊明",
            "姓氏":"楊",
            "名字":"明",
            "性別":"男",
            "公歷生日":"1984年04月03日12時30分",
            "農歷生日":"一九八四年三月初三日",
            "歲數":38,
            "星座":"白羊座",
            "屬相":"鼠",
            "幸運秘訣":{
                "幸運數字":"4、9",
                "大兇數字":"0、5",
                "吉祥顏色":"白色、黑色",
                "忌諱顏色":"黃色、咖色",
                "幸運花":"百合、非洲紫羅蘭、鈴蘭",
                "幸運物品":"小葉紫檀、古玉"
            },
            "本命佛":"千手觀音",
            "太歲":"金辨大將軍",
            "命主福元":"兌宮，屬西四命",
            "二十八宿":{ "所屬星宿":"壁宿", "星宿愛情":"凡是福平淡如水的感情生活比較適合你，因爲你感情太脆弱，經不起愛海的驚濤駭浪，就算是小小的漣漪，都教你死去活來。你喜愛情人的撫摸，就算多不開心，只要投入了情人的懷抱，就可以把創傷撫平。你向往婚姻生活，希望和情人可以白發齊眉，兒孫滿地。", "真愛方位":"東", "星宿吉祥物":"海豚" },
            "文昌位":"西方"
        },
        "命主八字稱骨信息":{
            "稱骨重量":"四兩八錢",
            "稱骨重量_命數":"官貴財祿、厚重之人",
            "稱骨重量_歌訣":"初年運道未曾通，幾許蹉跎命亦窮；\r兄弟六親無依靠，一生事業晚來整。",
            "稱骨重量_歌訣釋義":"您年輕時運氣總不好，老是很倒黴，做事容易失敗，親戚也幫不了多少，不過在您的不斷努力下，您的夢想會在中晚年成功。",
            "稱骨重量_命運詳解":"此命爲人性燥， 能隨機應變 ，常近貴人，祖業無成，骨肉親朋少義，自立家計。 初限交來財運如霜雪，中年略可成家，大運交來順家業， 妻有可， 小配無刑，子媳三人，只有一子送終，壽元七十七，卒于冬月之中。"
        },
        "命主姓名數理信息":{
            "姓名五行":[
                {
                    "簡體":"楊",
                    "繁體":"楊",
                    "拼音":"yang",
                    "繁體五行":"木",
                    "繁體筆畫":13
                },
                {
                    "簡體":"明",
                    "繁體":"明",
                    "拼音":"ming",
                    "繁體五行":"火",
                    "繁體筆畫":8
                }
            ],
            "天格":{
                "主運":"代表12歲前的先天運勢以及先天遺傳，影響不大，若不理想不必計較",
                "數理":"14",
                "數理暗示":"兇數運（表示逆境、沉浮、薄弱、病難、困難、多災等）\r藝能運（富有藝術天才，對審美、藝術、演藝、體育有通達之能）\r孤獨運（妻凌夫或夫克妻）",
                "象詞":"破兆",
                "簽語":" 家庭緣薄，孤獨遭難，謀事不達，悲慘不測。",
                "吉兇":"兇",
                "含義":"淪落天涯、失意煩悶數，家庭緣薄，多破兆。\r詩曰：淪落天涯失古恃，家族緣薄又克兒，寂寞類悶多災厄，己身浮沈無可樨。\r\r淪落天崖的失意煩悶的數。（兇）\r基業：暗祿、美貌、藝術、流浪、紅舞、劫財。\r家庭：骨肉疏遠。離祖遷居。自家兄弟全無分、外處事又能緣。\r健康：男女均屬好貌、皮膚病、感胃、風郁，先天五行相含有健康。\r含義：多破兆，家屬緣溥。喪親、喪子、兄弟姐妹分離孤獨，不如意，煩悶，危難，遭厄，浮沉不定，爲了慷慨。施惠招怨，勞而無功，凄慘孤獨，其他好運者不多，有傷夭壽。",
                "五行":"火"
            },
            "人格":{
                "主運":"代表24-48歲人生颠峰期運勢以及個性、才華及事業運，影響一生運勢",
                "數理":"21",
                "數理暗示":"首領運（智慧仁勇、立上位、能領導衆人）\r吉祥運（表示健全、幸福、名譽等）",
                "象詞":"明月中天",
                "簽語":"光風霁月，萬物确立，官運亨通，大搏名利。女性不宜此數。　",
                "吉兇":"大吉",
                "含義":"明月中天，萬物形成确定之勢，能爲領導，興家立業。（女性用則不吉，婚姻不順）\r詩曰：明月光照樂依依，唉如梅花待放時，男人頭領女不宜，各個獨立有權威。\r\r明月照光，體質剛健之數。（大吉）\r基業：天官、太極、文昌、哲學，財庫，福祿，首領，君臣，富翁。\r家庭：六親和睦，有中之嗣惠，若女人不爲吉，用則破大運。\r健康：秋月芙蓉，狀年健狀、長壽。\r含義：風光霁月之象，萬物形成自立這勢。獨立權威，能爲首領之運。爲人尊仰，享受富貴顯榮。路徑屬漸進發展，中途難免相當苦心，步步而進，宛如登梯一樣。立業興家，大博名利，乃貴重的吉數。因系偉大的首領格，婦女得此數者，反招災害。按《易經》上觀點女性屬陰，應從男性，是爲先天的補數。如具備首領之運，即妻凌夫之格。陰陽生出暗斗，自然不得安寧，故夫妻難免時常反目，或喜極余慶，且婦德爲備，家庭園滿，則非夫克妻，妻便克夫，所謂兩虎相斗，必無雙全者慎之！戒之！",
                "五行":"木"
            },
            "地格":{
                "主運":"代表36歲前的青年運勢以及家庭夫妻、子女田宅，影響基礎運",
                "數理":"9",
                "數理暗示":"兇數運（表示逆境、沉浮、薄弱、病難、困難、多災等）",
                "象詞":"大成之數",
                "簽語":"大成之數，蘊涵兇險，或成或敗，難以把握。",
                "吉兇":"兇",
                "含義":"吉盡兇始，窮乏之數。有不測災禍，實爲人生最大惡運。\r詩曰：與盡兇始入困途，窘迫病難失親和，災害短命無所止，生離死別卻哀悲。\r\r破舟進海，吉盡兇相，窮乏之數。（兇）\r基業：官祿、圖印、太極、怪傑、富翁、突破。\r家庭：親情不睦，口說長短者多，力持賢明者平安。\r健康：女性成風流或與夫別離病弱，弱女皆晚婚。多積德可免短命。\r含義：利去劫空，陷落窮迫、逆運、短命，悲痛或者幼小離親而困苦，或者病弱，不遇，遭難廢疾，貧困，災難，孤獨甚至刑罰。有不測遇兇禍，人格有此數者則爲大兇，即或一身得免災害。也難免配偶喪失。有缺子之嘆。實爲人生最大惡運但也有例外的怪傑，富豪能出此數者。",
                "五行":"水"
            },
            "外格":{
                "主運":"代表36-48歲的中年運勢以及社交、朋友、工作環境等，影響後天的機遇",
                "數理":"2",
                "數理暗示":"兇數運（表示逆境、沉浮、薄弱、病難、困難、多災等） ",
                "象詞":"兩儀之數",
                "簽語":"兩儀之數，混沌未開，進退保守，志望難達。",
                "吉兇":"大兇",
                "含義":"未定的分離破滅數，混沌未定，爲最大兇惡的暗示。\r詩曰：混濁未定如萍動，亂離不安亦波浪，獨立無力多災難，變動病弱又短命。\r\r一身孤節，屬末定的分離破滅數。（大兇）\r基業：劫財、破滅、災危、破家、紅艳、變遷、美貌。\r家庭：親情疏遠、夫妻應相互理解、則免別離之苦。\r健庭：兇弱、短亦有之，易患皮膚病外傷、矢折。\r含義：混沌末定數。爲最大兇惡的暗示，無獨力之氣力進退失自由、其內外生波瀾因苦不安。搖動、病患遭難，甚至殘廢。如伴有其他好數者不致夭折，其人辛苦一生，志望難達破滅無常。",
                "五行":"木"
            },
            "總格":{
                "主運":"代表48歲後的中晚年運勢以及財富、收入，影響人生最終的成就",
                "數理":"21",
                "數理暗示":"首領運（智慧仁勇、立上位、能領導衆人）\r吉祥運（表示健全、幸福、名譽等）",
                "象詞":"明月中天",
                "簽語":"光風霁月，萬物确立，官運亨通，大搏名利。女性不宜此數。　",
                "吉兇":"大吉",
                "含義":"明月中天，萬物形成确定之勢，能爲領導，興家立業。（女性用則不吉，婚姻不順）\r詩曰：明月光照樂依依，唉如梅花待放時，男人頭領女不宜，各個獨立有權威。\r\r明月照光，體質剛健之數。（大吉）\r基業：天官、太極、文昌、哲學，財庫，福祿，首領，君臣，富翁。\r家庭：六親和睦，有中之嗣惠，若女人不爲吉，用則破大運。\r健康：秋月芙蓉，狀年健狀、長壽。\r含義：風光霁月之象，萬物形成自立這勢。獨立權威，能爲首領之運。爲人尊仰，享受富貴顯榮。路徑屬漸進發展，中途難免相當苦心，步步而進，宛如登梯一樣。立業興家，大博名利，乃貴重的吉數。因系偉大的首領格，婦女得此數者，反招災害。按《易經》上觀點女性屬陰，應從男性，是爲先天的補數。如具備首領之運，即妻凌夫之格。陰陽生出暗斗，自然不得安寧，故夫妻難免時常反目，或喜極余慶，且婦德爲備，家庭園滿，則非夫克妻，妻便克夫，所謂兩虎相斗，必無雙全者慎之！戒之！",
                "五行":"木"
            },
            "三才配置":{
                "重點":"三才配置吉兇爲姓名測試之核心，請重點關注！",
                "三才解析":"1、總論:一生努力奮發向上,遇到任何困難都會耐心克服,能得到成功發展,但惟恐受意外災厄。或被人拖累,以致遭到失敗的打擊,天運五行屬水,成功較快。\n 2、性格:有創業的頭腦與能力,爲人努力又能忍耐,性情坦白直率,喜歡安靜,少言而多行,講話很干脆,有不認輸的傾向。\n 3、意志:意志堅定,注意實際與工作,耐性亦佳,思想正确,可一展抱負。\n 4、事業:適合腳踏實地的穩定性行業,不可投機或好高骛遠,免勞命傷財。\n 5、家庭:夫妻都能勤儉持家,但感情不太和睦,家內不甚平安。\n 6、姓名測試愛情:男娶好勝好強之妻,婚後感情時好時壞;女嫁有才干之夫,婚後大致美滿。\n 7、子女:女孩較多,個性較爲孤獨,身體較虛弱。\n 8、社交:有仁慈之心及努力忍耐的個性,受到別人的信賴,人緣及社交能力都不錯。\n 9、精神:表面樂觀奮斗,恐因意外事件而帶來精神不安與操勞。\n 10、財運:終日辛勞,有所成就,財運尚佳,天運五行屬金,一生勞多利少。\n 11、健康:易患泌尿系統疾病。\n 12、老運:晚景可享清福,衣食無憂,安然自在。",
                "三才吉兇":"兇",
                "基礎運":"一時雖能順利發展,但不時可能有衰亡、疾病的症兆。（兇）",
                "成功運":"上進順利,成功迅速,容易達到目的。（吉）",
                "社交運":"善容忍,少言多行,外柔內剛,能努力發展。但有猜疑心,三才不善者有急性的缺點。大多合作不利。有皮膚病。（吉）"
            },
            "姓名總分":{
                "分數":87.6,
                "說明":"根據名字測試打分，您的姓名評分爲：87.6分，你的名字取得不錯，如果與命理搭配得當，相信它會助你一生順利的，祝你好運！"
            }
        },
        "命主八字命盤信息":{
            "八字信息":{
                "公歷":{
                    "年":"1984年",
                    "月":"04月",
                    "日":"03日",
                    "時":"12點"
                },
                "農歷":{
                    "年":"甲子年",
                    "月":"三月",
                    "日":"初三",
                    "時":"午時"
                },
                "節氣":[
                    "清明：1984年04月04日22:25",
                    "谷雨：1984年04月20日05:33"
                ],
                "起運":"周歲：5個月19天9小時",
                "交運":"公歷：1984年09月22日21時30分",
                "胎元":"戊午[天上火]",
                "命宮":"壬申[劍鋒金]",
                "三命通會":[
                    "丁日丙午時生,以青云得路格論。午是丁的臨官祿地,如果地支沒有枭神破害,天干沒有癸來刑克,即可以建祿格論,主貴顯。如果地支有子卯,天干有癸破壞祿位,柱中雖有祿,卻似無祿一般。",
                    "丁卯日丙午時生，因日柱有卯刑破丁，故健旺中招惹禍災。生于巳月，且行西北運，貴顯；行東南運，任大官，掌大權。年月支是寅亥，從事武職，官至二品。如果是子酉，大貴。"
                ],
                "月柱命理":"此月生人，前年六月受胎，清明節後出生。志氣不凡，內心強固，交際巧妙，腦智明晰。寬宏大量，事多忍耐，忍耐不如奮斗，莫要錯失良機。應修身謹慎，有重色情前程，爲情色害良緣之虞。三十歲前逢盛運，財來財往，有虛元實；四十歲後自安然，凡事順遂，不可焦急。福祿永在。\r\r\n詩曰：爲人心情自寬懷，平生積得四方財，一旦時來當發福，猶如枯木遇春天。　\r\r\n",
                "日柱命理":"此日生人，夫妻和睦，不能偕老，子息克乏，須修身布德，初年多乖，三十有慶，受人提拔，四十盛運，左作右中，環境良好，榮華之命。",
                "時柱命理":[
                    "（上午十一點起下午一點止爲馬時晨）\n伶俐敏捷，不守祖業，自作聰明，女人嬌嬌，極端主人，浪費奢侈。\n適業：醫師、護士、政治。明星、技藝、料理店、油業。忌金類。\n兇年：六歲、十二歲、什四歲、卅三歲、四十五歲、八十五歲壽終。\n午時頭生：時頭生人父母在，爲人利害近貴人，兄弟六親皆有靠，子息三五衣祿歸。\n午時中生：時中生人先克父，福祿平平苦奔波，三十歲後漸漸好，先難後益得安然。\n午時末生：時末生人先克母，聰明伶俐兼性急，兄弟六親難可靠，衣食不周多奔波。　"
                ],
                "命理綜述":"請見【八字精批詳解】"
            },
            "八字精批詳解":{
                "您的性格分析":{
                    "優點":"覺力強，反應快，有很強的環境適應力和應 變能力。 機智、點子多，善解人意。 有一副樂天命的模樣。 多才多藝。 女性特別喜愛乾淨，會將家務整理得有條不紊。 伶俐乖巧，具有樣樣都學的靈巧和樂天性格。 個性比較活躍多變化且利欲心強。 富幻想力，識時務，很會利用機會，爽朗活潑，討人喜愛。 屬鼠人感覺敏銳無所不能而且善於多角經營。 好奇心強對任何事情都想很快插上一手且能巧妙地處理。 ",
                    "缺點":"缺乏膽識、做事魄力不夠，缺適當指揮能力 ，不足以擔任商業機構或其他團體之領導 ，欠威嚴。 有固執已見之性格，有見利妄行之缺點。 有晚睡習慣，因爲鼠是夜間活動的動物。 本性善良但態度有些不禮貌。 具自私的本位主義或桀傲不馴的個性。 善於投機取巧，愛挑剔，心胸不夠遠大。 "
                },
                "您的財運分析":{
                    "流年財運":"財星高照，財源茂盛。很適合投資和創業。若與人合資，只要選對項目并保持自己的權利，會有很好的回報。",
                    "本命財運":"由于屬鼠人從來不放過討價還價和做“好交易”的機會，也常常難于準确無誤地當機立斷，結果使自己掉進圈套。常言道“吃一塹方可長一智”，在屬鼠人的一生中，在懂得貪婪有弊無益之前，至少要遭受一次很大的金錢方面的打擊。",
                    "注意事項":"你的漏財大多因外力引起，例如：掉錢包，車子被撞，受傷，失竊等等。也容易因爲情緒波動或一時賭氣瘋狂購物而損財，而且一旦起來不計後果。另外，也要小心受不了親友的訴苦、裝可憐而借出款項，有去無回較多。"
                },
                "您的愛情戀愛建議":{
                    "愛情分析":"感情方面會出現放縱、消極的情緒，愛情方面也不理想。雖然與異性投緣，但容易惹上桃色新聞，也容易欲火焚身而做出有辱名聲的行爲，切收斂。\n\n大吉婚配： 龍(辰)、猴(申)、牛(丑)\n\n忌婚配： 馬(午)、羊(未)、雞(酉) 、兔(卯)"
                },
                "您的健康建議":{
                    "中醫五行":"您的八字火旺缺土，從中醫養生上來說，給您如下建議：",
                    "健康分析":"丁日生的人雖沒有旺盛的生命，但因擁有穩重的長處，會自己照料生活，所以反而多是健康的人。這型人擅長于擊退輕症小病，有心髒病的暗示，特別是狹心症或心髒瓣膜症。此外，也須注意肺炎、肋膜炎。",
                    "易患疾病":"心髒病、皮膚病、腦溢血等。",
                    "易發症狀":"心慌、失眠、水腫、皮膚病、自汗盜汗、視物不清、小便澀痛、關節酸痛等。",
                    "養生要點":"心在五行屬火，火型人體質偏于心陰虛火旺。主要表現爲心煩失眠、口渴、舌質紅等特點。火型人身體內陽氣比較旺盛，養生的關鍵在于滋陰抑陽，調養心腎，以水濟火。火型人要注意的人體器官是心髒與小腸，其次是血脈及整個循環系統。火型人有易患熱病、血症及暴病的潛在傾向。比如冠心病、動脈硬化、腦溢血等疾病。火型體質人最重要的是養心，除了多吃養生食物之外，冬季好好補養腎氣是個不錯的方法。\r\n",
                    "生活起居":"陰虛者，畏熱喜寒，寒冬易過，熱夏難當。每逢春夏季，可到海邊、林區、山區去旅遊休假。\r\n",
                    "飲食調節":"養心最好吃些赤色食物，其原則要保陰潛陽，多吃清淡食物，以清淡之品爲宜。如糯米、芝麻、蜂蜜、乳品、豆腐、魚、蔬菜、水果等。有條件的人可食用一些海參、龜肉、蟹肉、銀耳、雄鴨、冬蟲夏草等。燥熱辛辣之品則應少吃。",
                    "保健膳食":"蓮子龍眼粥——龍眼蓮子肉各30克，糯米100克，加水燒沸，再改爲小火慢慢煮至米粒爛透即可，常服此粥可養心補血，潤膚養顏。\r\n"
                },
                "您的事業成就":{
                    "喜用神":"您的八字喜用神爲【金】，從事屬【金】行業較有利于您的事業發展。",
                    "事業發展建議":"有利事業的方向以及概要說明：\r\n1、四柱喜金,有利的方位是西方（以父出生地爲基準），不利南方，東南；其人喜白色，不利紅色，喜居住坐西朝東的房子，床的放置東西向，床頭在西。\r\n2、取名用字五行屬金的有利。 \r\n3、四柱喜金，應從事與金有關的事業或職業爲宜，如經營五金器材，粗鐵材或金屬工具材料等方面事業，堅硬事業、決斷事業、主動別人性質的事業，一切武術家、鑒定師（評估師）、拍賣人員、法官、執法人員、總主宰、汽車界、交通界、金融界、工程業、科學界、武術家、開礦界、民意代表、珠寶界、伐木事業。\r\n4、事業發展利西、中西, 不利南、東南。 \r\n5、吉祥數字爲: 7 8 \r\n6、吉利樓層末位數爲：4 9 ",
                    "三合貴人":"與三合貴人共事或者得到三合貴人的幫助有利于你的事業的發展，有利于你的三合生肖是【鼠，猴，龍】"
                },
                "未來一年運程":[
                    {
                        "日期":"2023年 1月 6日～2023年 2月 4日",
                        "運勢":"山高水深多險處，果有舟車不易行。\r\n衝財生風波，防受騙上當。",
                        "十神":"十神爲七殺：其表象範圍大多與武職、軍銜、訴訟、外敵、建築，以及兒女、女性的情人等有關。\r\n吉象：做事干脆利落，工作效率高，較易文成武就。俠義助人受人感激，名聲顯赫，有地位或有權威。\r\n兇象：個性太張揚，聰明反被聰明誤，自己容易受損失。生活起伏較大，身體易受傷殘。女性早婚不利。"
                    },
                    {
                        "日期":"2023年 2月 4日～2023年 3月 6日",
                        "運勢":"無端夜雨迷秋月，不意狂風折好花。\r\n財源廣進，有購置建設等好事。",
                        "十神":"十神爲正印：其表象範圍大多與學業、藝術，以及長輩、師長、母親、女婿等有關。\r\n吉象：自己的天賦較易發揮，學業藝術方面有發展。\r\n兇象：勞神費心，工作受自己的情緒影響較大，女性不利子女。"
                    },
                    {
                        "日期":"2023年 3月 6日～2023年 4月 5日",
                        "運勢":"飛符爲患又爲災，啾唧無端水破財。\r\n有得有失，存款宜購置，平運。",
                        "十神":"十神爲偏印：其表象範圍大多與學術研究、愛好特長，以及長輩、 貴人、母親等有關。\r\n吉象：較易得貴人幫助，愛好特長易發揮，學術研究較易有成就。\r\n兇象：學業或事業有波折，生活不安定，名譽有損，或母親有事。不利子女，易發生交通事故。"
                    },
                    {
                        "日期":"2023年 4月 5日～2023年 5月 5日",
                        "運勢":"雙飛紫燕兩分飛，夫君不永命先歸。\r\n小衝財，出外防財物丟失，收入一般。",
                        "十神":"十神爲比劫：其表象範圍大多與本身的思想言行、陳規陋習、決策計畫，以及朋友、同輩、兄弟姐妹等有關。\r\n吉象：理想遠大，進取心強，有主見，敢于與不良現象作斗爭。\r\n兇象：不容易聽取別人的意見，固執已見、獨斷專行，多招惹诽謗有傷名譽。做事沒有恒心，說的多做的少。易染上酗酒賭博等惡習。男性要防婚變，女性婚期早不利。"
                    },
                    {
                        "日期":"2023年 5月 5日～2023年 6月 6日",
                        "運勢":"叩門聲急是非多，一見官非病又難。\r\n運氣平平，益同胞之運。",
                        "十神":"十神爲比肩：其表象範圍大多與本身的事業、思想言行、決策、健康安全，以及兄弟姐妹、同學、同事、朋友、近鄰等有關。\r\n吉象：個性張揚，事業心較強，勇于向不利環境挑戰，在異鄉較順利，較得朋友之助力。\r\n兇象：易爭強斗勝、獨斷專行，常遭小人陷害，或受兄弟姐妹、同事或朋友拖累而破財，合作事業易散伙，父親受牽累。夫妻易生是非。"
                    },
                    {
                        "日期":"2023年 6月 6日～2023年 7月 7日",
                        "運勢":"風雨凄凄正愁人，窗前寂寞有誰知。\r\n防與人發生糾紛，官場交際防官非，生挫折。",
                        "十神":"十神爲傷官：其表象範圍大多與理想追求、愛好特長、文學技術、公共關系、遷移調動，以及兒女、學生、晚輩、部屬、性欲等有關。\r\n吉象：比平時有較高的智慧和才能，聰明智謀多，在音樂藝術、愛好特長方面較易成功。\r\n兇象：本性過度暴露，惹事生非好管事，易與人產生過節，孤獨寂寞。男性易盲目追求愛情而有損名譽及事業。女性防婚姻不順利。"
                    },
                    {
                        "日期":"2023年 7月 7日～2023年 8月 8日",
                        "運勢":"一朝煙雨一朝晴，晴不多時雨又淋。\r\n財運通，謀事有貴人扶持，幸運。",
                        "十神":"十神爲食神：其表象範圍大多與開業遷居、文學寫作、自由職業、專業技術，以及子女、學生、下屬、性欲等有關。\r\n吉象：學業事業較易進步和成功，天賦較易發揮。愛情也較易產生和進展，易交桃花運。女性較易懷胎生育。\r\n兇象：聰明易被聰明誤，產生矛盾，引起官司訴訟。外表光華內裏平淡，防過度勞神而損身心；盲目追求愛情而有損名譽及事業。男女要防矛盾和婚變。"
                    },
                    {
                        "日期":"2023年 8月 8日～2023年 9月 8日",
                        "運勢":"黃金久淹在泥沙，有日開藏世共挎。\r\n威信高，收入高，順利。男性益妻。",
                        "十神":"十神爲正財：其表象範圍大都與財產、金錢，以及父親、男性的妻子或女友等有關。\r\n吉象：財運亨通，有比平時較多求財的機遇。父親較有利，或容易交上女友，姻緣不錯。\r\n兇象：易引起財產或金錢糾紛，意外破耗。財多傷母克妻，易發生感情破裂。"
                    },
                    {
                        "日期":"2023年 9月 8日～2023年 10月 8日",
                        "運勢":"一日愁來百事多，心中煩惱亂如麻。\r\n運氣一般，小衝財，存款宜購置，守舊業較好。",
                        "十神":"十神爲偏財：其表象範圍大都與商業、財產、金錢，以及父親、男性的情人、女性的婆婆等有關。\r\n吉象：人緣好口碑佳，生意買賣比較順利，富裕發達。男性風流豪爽，易得女人喜歡。\r\n兇象：本地求財不易得，財雖多但不易存下，婚姻感情易變。"
                    },
                    {
                        "日期":"2023年 10月 8日～2023年 11月 7日",
                        "運勢":"玉兔催人投宿處，金雞喚客束行裝。\r\n一航風順，財運通，有購置建設等好事，但好事中有小阻。女性益夫。",
                        "十神":"十神爲正官：其表象範圍大多與職位、名譽、權力、事業競爭、上司，以及子女、女性的丈夫或男友等有關。\r\n吉象：職位權力易穩固或上升，官司易獲勝訴或平反，學業或事業較順利。男性較易獲得子女尊重。女性的丈夫較有地位或權威。\r\n兇象：易遭诽謗財受損，易發生是非爭執，影響職位、名譽，兄弟姐妹易發生刑傷。女性之丈夫或男友易有不利事。"
                    },
                    {
                        "日期":"2023年 11月 7日～2023年 12月 7日",
                        "運勢":"如花開時便凋殘，恨殺無情風雨催。\r\n衝財生挫折，不宜遠走求財。",
                        "十神":"十神爲七殺：其表象範圍大多與武職、軍銜、訴訟、外敵、建築，以及兒女、女性的情人等有關。\r\n吉象：做事干脆利落，工作效率高，較易文成武就。俠義助人受人感激，名聲顯赫，有地位或有權威。\r\n兇象：個性太張揚，聰明反被聰明誤，自己容易受損失。生活起伏較大，身體易受傷殘。女性早婚不利。"
                    },
                    {
                        "日期":"2023年 12月 7日～2024年 1月 6日",
                        "運勢":"無端夜雨迷秋月，不意狂風折好花。\r\n財源廣進，有購置建設等好事。",
                        "十神":"十神爲正印：其表象範圍大多與學業、藝術，以及長輩、師長、母親、女婿等有關。\r\n吉象：自己的天賦較易發揮，學業藝術方面有發展。\r\n兇象：勞神費心，工作受自己的情緒影響較大，女性不利子女。"
                    }
                ]
            },
            "八字_年柱":{
                "十神":"正印",
                "乾造":"甲子",
                "藏干":[
                    [
                        "癸",
                        "(偏官)"
                    ]
                ],
                "納音":"海中金"
            },
            "八字_月柱":{
                "十神":"比肩",
                "乾造":"丁卯",
                "藏干":[
                    [
                        "乙",
                        "(偏印)"
                    ]
                ],
                "納音":"爐中火"
            },
            "八字_日柱":{
                "十神":"日主",
                "乾造":"丁卯",
                "藏干":[
                    [
                        "乙",
                        "(偏印)"
                    ]
                ],
                "納音":"爐中火"
            },
            "八字_時柱":{
                "十神":"劫財",
                "乾造":"丙午",
                "藏干":[
                    [
                        "己",
                        "(食神)"
                    ],
                    [
                        "丁",
                        "(比肩)"
                    ]
                ],
                "納音":"天河水"
            },
            "八字_大運":[
                {
                    "虛歲":"0-9",
                    "年份":"1984-1993",
                    "大運":[
                        "衰",
                        "傷官",
                        "戊辰"
                    ],
                    "流年":[
                        "甲子",
                        "乙丑",
                        "丙寅",
                        "丁卯",
                        "戊辰",
                        "己巳",
                        "庚午",
                        "辛未",
                        "壬申",
                        "癸酉"
                    ],
                    "流年吉兇":[
                        {
                            "流年":"甲子",
                            "吉兇":"兇"
                        },
                        {
                            "流年":"乙丑",
                            "吉兇":"無"
                        },
                        {
                            "流年":"丙寅",
                            "吉兇":"兇"
                        },
                        {
                            "流年":"丁卯",
                            "吉兇":"吉"
                        },
                        {
                            "流年":"戊辰",
                            "吉兇":"兇"
                        },
                        {
                            "流年":"己巳",
                            "吉兇":"兇"
                        },
                        {
                            "流年":"庚午",
                            "吉兇":"兇"
                        },
                        {
                            "流年":"辛未",
                            "吉兇":"無"
                        },
                        {
                            "流年":"壬申",
                            "吉兇":"大兇"
                        },
                        {
                            "流年":"癸酉",
                            "吉兇":"兇"
                        }
                    ]
                },
                {
                    "虛歲":"10-19",
                    "年份":"1994-2003",
                    "大運":[
                        "帝旺",
                        "食神",
                        "己巳"
                    ],
                    "流年":[
                        "甲戌",
                        "乙亥",
                        "丙子",
                        "丁丑",
                        "戊寅",
                        "己卯",
                        "庚辰",
                        "辛巳",
                        "壬午",
                        "癸未"
                    ],
                    "流年吉兇":[
                        {
                            "流年":"甲戌",
                            "吉兇":"兇"
                        },
                        {
                            "流年":"乙亥",
                            "吉兇":"兇"
                        },
                        {
                            "流年":"丙子",
                            "吉兇":"兇"
                        },
                        {
                            "流年":"丁丑",
                            "吉兇":"無"
                        },
                        {
                            "流年":"戊寅",
                            "吉兇":"兇"
                        },
                        {
                            "流年":"己卯",
                            "吉兇":"吉"
                        },
                        {
                            "流年":"庚辰",
                            "吉兇":"兇"
                        },
                        {
                            "流年":"辛巳",
                            "吉兇":"兇"
                        },
                        {
                            "流年":"壬午",
                            "吉兇":"兇"
                        },
                        {
                            "流年":"癸未",
                            "吉兇":"無"
                        }
                    ]
                },
                {
                    "虛歲":"20-29",
                    "年份":"2004-2013",
                    "大運":[
                        "臨官",
                        "正財",
                        "庚午"
                    ],
                    "流年":[
                        "甲申",
                        "乙酉",
                        "丙戌",
                        "丁亥",
                        "戊子",
                        "己丑",
                        "庚寅",
                        "辛卯",
                        "壬辰",
                        "癸巳"
                    ],
                    "流年吉兇":[
                        {
                            "流年":"甲申",
                            "吉兇":"大兇"
                        },
                        {
                            "流年":"乙酉",
                            "吉兇":"兇"
                        },
                        {
                            "流年":"丙戌",
                            "吉兇":"兇"
                        },
                        {
                            "流年":"丁亥",
                            "吉兇":"兇"
                        },
                        {
                            "流年":"戊子",
                            "吉兇":"兇"
                        },
                        {
                            "流年":"己丑",
                            "吉兇":"無"
                        },
                        {
                            "流年":"庚寅",
                            "吉兇":"兇"
                        },
                        {
                            "流年":"辛卯",
                            "吉兇":"吉"
                        },
                        {
                            "流年":"壬辰",
                            "吉兇":"兇"
                        },
                        {
                            "流年":"癸巳",
                            "吉兇":"兇"
                        }
                    ]
                },
                {
                    "虛歲":"30-39",
                    "年份":"2014-2023",
                    "大運":[
                        "冠帶",
                        "偏財",
                        "辛未"
                    ],
                    "流年":[
                        "甲午",
                        "乙未",
                        "丙申",
                        "丁酉",
                        "戊戌",
                        "己亥",
                        "庚子",
                        "辛丑",
                        "壬寅",
                        "癸卯"
                    ],
                    "流年吉兇":[
                        {
                            "流年":"甲午",
                            "吉兇":"兇"
                        },
                        {
                            "流年":"乙未",
                            "吉兇":"無"
                        },
                        {
                            "流年":"丙申",
                            "吉兇":"大兇"
                        },
                        {
                            "流年":"丁酉",
                            "吉兇":"兇"
                        },
                        {
                            "流年":"戊戌",
                            "吉兇":"兇"
                        },
                        {
                            "流年":"己亥",
                            "吉兇":"兇"
                        },
                        {
                            "流年":"庚子",
                            "吉兇":"兇"
                        },
                        {
                            "流年":"辛丑",
                            "吉兇":"無"
                        },
                        {
                            "流年":"壬寅",
                            "吉兇":"兇"
                        },
                        {
                            "流年":"癸卯",
                            "吉兇":"吉"
                        }
                    ]
                },
                {
                    "虛歲":"40-49",
                    "年份":"2024-2033",
                    "大運":[
                        "沐浴",
                        "正官",
                        "壬申"
                    ],
                    "流年":[
                        "甲辰",
                        "乙巳",
                        "丙午",
                        "丁未",
                        "戊申",
                        "己酉",
                        "庚戌",
                        "辛亥",
                        "壬子",
                        "癸丑"
                    ],
                    "流年吉兇":[
                        {
                            "流年":"甲辰",
                            "吉兇":"兇"
                        },
                        {
                            "流年":"乙巳",
                            "吉兇":"兇"
                        },
                        {
                            "流年":"丙午",
                            "吉兇":"兇"
                        },
                        {
                            "流年":"丁未",
                            "吉兇":"無"
                        },
                        {
                            "流年":"戊申",
                            "吉兇":"大兇"
                        },
                        {
                            "流年":"己酉",
                            "吉兇":"兇"
                        },
                        {
                            "流年":"庚戌",
                            "吉兇":"兇"
                        },
                        {
                            "流年":"辛亥",
                            "吉兇":"兇"
                        },
                        {
                            "流年":"壬子",
                            "吉兇":"兇"
                        },
                        {
                            "流年":"癸丑",
                            "吉兇":"無"
                        }
                    ]
                },
                {
                    "虛歲":"50-59",
                    "年份":"2034-2043",
                    "大運":[
                        "長生",
                        "偏官",
                        "癸酉"
                    ],
                    "流年":[
                        "甲寅",
                        "乙卯",
                        "丙辰",
                        "丁巳",
                        "戊午",
                        "己未",
                        "庚申",
                        "辛酉",
                        "壬戌",
                        "癸亥"
                    ],
                    "流年吉兇":[
                        {
                            "流年":"甲寅",
                            "吉兇":"兇"
                        },
                        {
                            "流年":"乙卯",
                            "吉兇":"吉"
                        },
                        {
                            "流年":"丙辰",
                            "吉兇":"兇"
                        },
                        {
                            "流年":"丁巳",
                            "吉兇":"兇"
                        },
                        {
                            "流年":"戊午",
                            "吉兇":"兇"
                        },
                        {
                            "流年":"己未",
                            "吉兇":"無"
                        },
                        {
                            "流年":"庚申",
                            "吉兇":"大兇"
                        },
                        { "流年":"辛酉", "吉兇":"兇" },
                        { "流年":"壬戌", "吉兇":"兇" },
                        { "流年":"癸亥", "吉兇":"兇" }
                    ]
                },
                {
                    "虛歲":"60-69",
                    "年份":"2044-2053",
                    "大運":[ "養", "正印", "甲戌" ],
                    "流年":[ "甲子", "乙丑", "丙寅", "丁卯", "戊辰", "己巳", "庚午", "辛未", "壬申", "癸酉" ],
                    "流年吉兇":[
                        { "流年":"甲子", "吉兇":"兇" },
                        { "流年":"乙丑", "吉兇":"無" },
                        { "流年":"丙寅", "吉兇":"兇" },
                        { "流年":"丁卯", "吉兇":"吉" },
                        { "流年":"戊辰", "吉兇":"兇" },
                        { "流年":"己巳", "吉兇":"兇" },
                        { "流年":"庚午", "吉兇":"兇" },
                        { "流年":"辛未", "吉兇":"無" },
                        { "流年":"壬申", "吉兇":"大兇" },
                        { "流年":"癸酉", "吉兇":"兇" }
                    ]
                },
                {
                    "虛歲":"70-79",
                    "年份":"2054-2063",
                    "大運":[
                        "胎",
                        "偏印",
                        "乙亥"
                    ],
                    "流年":[
                        "甲戌",
                        "乙亥",
                        "丙子",
                        "丁丑",
                        "戊寅",
                        "己卯",
                        "庚辰",
                        "辛巳",
                        "壬午",
                        "癸未"
                    ],
                    "流年吉兇":[
                        {
                            "流年":"甲戌",
                            "吉兇":"兇"
                        },
                        {
                            "流年":"乙亥",
                            "吉兇":"兇"
                        },
                        {
                            "流年":"丙子",
                            "吉兇":"兇"
                        },
                        {
                            "流年":"丁丑",
                            "吉兇":"無"
                        },
                        {
                            "流年":"戊寅",
                            "吉兇":"兇"
                        },
                        {
                            "流年":"己卯",
                            "吉兇":"吉"
                        },
                        {
                            "流年":"庚辰",
                            "吉兇":"兇"
                        },
                        {
                            "流年":"辛巳",
                            "吉兇":"兇"
                        },
                        {
                            "流年":"壬午",
                            "吉兇":"兇"
                        },
                        {
                            "流年":"癸未",
                            "吉兇":"無"
                        }
                    ]
                },
                {
                    "虛歲":"80-89",
                    "年份":"2064-2073",
                    "大運":[
                        "絕",
                        "劫財",
                        "丙子"
                    ],
                    "流年":[
                        "甲申",
                        "乙酉",
                        "丙戌",
                        "丁亥",
                        "戊子",
                        "己丑",
                        "庚寅",
                        "辛卯",
                        "壬辰",
                        "癸巳"
                    ],
                    "流年吉兇":[
                        {
                            "流年":"甲申",
                            "吉兇":"大兇"
                        },
                        {
                            "流年":"乙酉",
                            "吉兇":"兇"
                        },
                        {
                            "流年":"丙戌",
                            "吉兇":"兇"
                        },
                        {
                            "流年":"丁亥",
                            "吉兇":"兇"
                        },
                        {
                            "流年":"戊子",
                            "吉兇":"兇"
                        },
                        {
                            "流年":"己丑",
                            "吉兇":"無"
                        },
                        {
                            "流年":"庚寅",
                            "吉兇":"兇"
                        },
                        {
                            "流年":"辛卯",
                            "吉兇":"吉"
                        },
                        {
                            "流年":"壬辰",
                            "吉兇":"兇"
                        },
                        {
                            "流年":"癸巳",
                            "吉兇":"兇"
                        }
                    ]
                }
            ]
        },
        "命主五行和喜神信息":{
            "五行分數":[
                {
                    "五行":"木",
                    "分數":"34.20"
                },
                {
                    "五行":"火",
                    "分數":"42.20"
                },
                {
                    "五行":"土",
                    "分數":"3.20"
                },
                {
                    "五行":"金",
                    "分數":"2.10"
                },
                {
                    "五行":"水",
                    "分數":"19.30"
                }
            ],
            "同類得分":{
                "同類五行":"火木",
                "同類得分":76.4
            },
            "異類得分":{
                "異類五行":"水金土",
                "異類得分":24.6
            },
            "旺衰得分":{
                "得分":"51.80",
                "評級":"八字過硬"
            },
            "喜用神":"金",
            "八字喜神":"八字過硬，八字喜金，金就是此命的「喜神」。",
            "八字論命":"八字論命是在找五行陰陽的平衡。同類和異類得分基本相同時，五行陰陽較平衡，一生較順利。當同類和異類得分相差過大時，人生八字就過硬或過弱，一生起伏較大。喜神的選擇一般從得分最少的哪一類中選取，此類中值最少的五行就是你的「喜神」或稱「有用之神」。當「喜神」來自流年或大運時，命盤的五行會較平衡。平衡的五行較不會打架。換言之，不愉快的事會減到最低點，那一年就會較幸運。八字就是從這個平衡理論，去分析人一生的起落。\r\n 這裏，我們就選[金]當做此命的「喜神」。"
        },
        "命主日干論命信息":{
            "生辰八字":[
                "甲子",
                "丁卯",
                "丁卯",
                "丙午"
            ],
            "八字五行":[
                "木水",
                "火木",
                "火木",
                "火火"
            ],
            "五行納音":[
                "海中金",
                "爐中火",
                "爐中火",
                "天河水"
            ],
            "五行個數":"0個金，3個木，1個水，4個火，0個土",
            "同類異類":"同類火木；異類水金土",
            "五行旺衰":"本命屬鼠，海中金命。火旺缺土；日主天干爲【火】，生于【春季】。",
            "四季用神":"此時必爲丙火或丁火，大都不錯，但忌木多、土多",
            "日干心性":"敦厚樸實,重信守義,但任性逞強,防止受騙,有時缺乏耐力,辦事易半途而廢。專勁不夠。",
            "日干層次":"[丁卯][中等]坐印通根，主人聰明有學問。若四柱出現亥卯未三合局或寅卯辰三會局，爲大貴人，但身坐[偏印，只能爲副職，輔佐他人。",
            "日干支分析":"手足不停，身心不闲，內外有勞，衣祿不少，性巧聰明，做事有頭少尾，男人福份之命，女人企圖寧靜，操勞中有幸而獲，防不知足？",
            "性格分析":"丁字在字典中僅次于一,排在第二位,擁有特異的地位。史記、律書中記載“丁者,言萬物之丁壯也”。它就像樹頂上枝葉茂盛的狀態。\r\n古時到達征兵年齡的人稱作壯丁,也有丁年的說法,意指男子成丁之年(二十歲),漢書、嚴安傅中載有“丁男被甲,丁女轉輪,苦不聊生”,丁女也指成年的女子。這種旺盛的力量也是來自火性。\r\n丙丁雖同屬火,但丙像太陽,而丁則像夜空中閃爍的星星,或者可說火之兄是熔爐中卷成漩渦的火花,而火之弟則是祭壇上的燭火。因此丁的性格是屬干脆、內藏熱情型。頭腦轉的快,極富進取精神,是個幾近狡猾很會鑽營的人。然而丁的人偶而會無法克制內在的激烈與表面的溫和所引起的衝突。由于長久被他人評定爲“溫和的人”,自己也盡量扮演這個角色,但某個時候會突然暴露自己的衝動。\r\n丁卯日生的人因不擅長處理利害關系,所以常在不知不覺中傷害別人。自己不但在精神上容易沮喪,就連身體也不很強健。運勢當然也不強。",
            "愛情分析":"這種類型的男性會使戀情持久，他不象丙以瞬間的爆發力來決定戀愛的勝負，一旦他對某一個女性萌生戀情，就會像炭火般，自內心持續熱力，火苗很難消失，他的戀情也不是以肉欲爲起點，而是著重于和對方心靈相通的喜悅，就算是個短短的約會，如果能眉目傳情即以心滿意足。\r\n丁日生的男性相信一種神秘的緣份，十分重視彼此的邂逅，象在無意中進入的咖啡廳中巧遇女服務生，他也會有命中注定的感覺，此外會深受占星術書中的暗示所影響，這些特征都與動物性的本能相結合。",
            "事業分析":"丁字有“燭燈”的暗示，燭火搖搖曳曳，雖然火光不大，卻都是由內心發出，因此這類人多選擇宗教、信仰等職業，進而在婚喪喜慶或福利事業界活躍，即使自己的職業與福利無關，也會花很多時間從事義工活動。\r\n火屬藝術或學術文化的性質，因此丁的人很自然的會朝音樂、繪畫、書法、花道、茶道等方向發展，如果廣義的诠譯藝術活動，電影界也可包括在內，世界級導演黑澤明就能把這種特性發揚光大，此外，丁的人也可考慮樂器、唱片、玩具、模型、玩偶等與趣味娛樂用品相關的事業。\r\n火的人擅長藝術或娛樂事業，但丙多是活躍于表面的藝人，而丁則適合從事幕後工作，如成爲經紀人或制作人，尤其以庚年生的人最適合當協助性的經紀人，因他不會被對方或工作引入歧途，而能冷靜的處理事務。",
            "財運分析":"丁的人擁有一顆超越金錢的心，由于不善計較得失，反而會因金錢之事傷害周圍的人。他人認爲十分龐大的金額，在丁的人眼中根本不當回事，就算向人借來暫用，也會因忘記歸還而造成他人的困擾。\r\n不過也有完全相反的例外出現，他們會對金錢十分執著，由于丁天性淡泊金錢，所以盡管執著，也還算不上是個吝啬鬼。但他們往往以“金錢不是萬能”爲理由，善于計算到了接近失禮的地步。",
            "健康分析":"丁日生的人雖沒有旺盛的生命，但因擁有穩重的長處，會自己照料生活，所以反而多是健康的人。這型人擅長于擊退輕症小病，有心髒病的暗示，特別是狹心症或心髒瓣膜症。此外，也須注意肺炎、肋膜炎。"
        }
    }
}
